# Compound Data Types

## 1.1 List
* A list is an object that contains multiple data items.
* Lists are mutable or dynamic, which means that their contents can be changed during the program's execution
* Lists are dynamics structures, meaning that items may be added to them or removed from them.
* Lists are heterogenous

In [1]:
['apples','oranges','cherries']

['apples', 'oranges', 'cherries']

In [2]:
prod_nums=['V475','F987','Q143','R688']
prod_nums

['V475', 'F987', 'Q143', 'R688']

In [3]:
sales_by_month=[250,180,360,340]
sales_by_month

[250, 180, 360, 340]

In [4]:
#nested lists
sales_by_season=[[250,180,360],[340,450,250,],[180,230,320],[550,360,190]]
sales_by_season

[[250, 180, 360], [340, 450, 250], [180, 230, 320], [550, 360, 190]]

Exercise: Create a list to store your name, age and gender.

In [5]:
my_details=['Prasad',21,'Male']
my_details

['Prasad', 21, 'Male']

### 1.1.1 Common Operations on Lists

In [6]:
len(sales_by_month)

4

In [7]:
sales_by_month[1]=230 #changing the element at the index 1
sales_by_month

[250, 230, 360, 340]

List Slicing / Indexing

In [8]:
sales_by_month[1:3] #element from the index 1 to 2

[230, 360]

Creating Lists

In [9]:
#use list() and range() to create lists
a=list(range(2,20)) #from 2 to 20
a

[2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [10]:
a=list(range(2,20,2)) #from 2 to 20 with steps=2
a

[2, 4, 6, 8, 10, 12, 14, 16, 18]

In [11]:
a[2:6] #stopping position is excluded

[6, 8, 10, 12]

In [12]:
a[2:6:2] #skippinf every second element

[6, 10]

Excercise: Create a list of the first twenty positive integers, slice it to find all even numbers.

In [13]:
l=list(range(1,21))
l[1:21:2]

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

### 1.1.2 Other List Operations

Joing Lists

In [14]:
#Joing two lists
sales_by_month=[250,180,360,340]
sales_new=[99,100,101,102]
sales_by_month+=sales_new
sales_by_month

[250, 180, 360, 340, 99, 100, 101, 102]

In [15]:
#use function to find items in a list
prod_nums=['V475','F987','Q143','R688']
search=input('Enter a product number: ')
if search in prod_nums:
    print("We found the product")
else:
    print("Product is not found")

Enter a product number: X123
Product is not found

In [16]:
'X123' in prod_nums

False

Iterating on a list

In [17]:
#for loop on a list
print('Month \t','Sales')
i=1
for x in sales_by_month:
    print(i,'\t', x)
    i=i+1

Month 	 Sales
1 	 250
2 	 180
3 	 360
4 	 340
5 	 99
6 	 100
7 	 101
8 	 102

### 1.1.3 List Methods

A method in python is similiar to a function, except it is associated with an object. Unlike a function, method are called on an object by `Object.method()`  
1. Use tab key followed by `object.` to list all methods associated with the object.
2. Use `Object.method?` method to show the key information about the method

Use methods for lists

In [18]:
A=list(range(1,6))
A

[1, 2, 3, 4, 5]

In [19]:
#.append() method to add elements to the end
A.append(30)
A

[1, 2, 3, 4, 5, 30]

In [20]:
#.pop() removes the last element
A.pop()
A

[1, 2, 3, 4, 5]

In [21]:
A.pop(3)# removes element at index 3
A

[1, 2, 3, 5]

In [22]:
A.remove(2) #find the element 2 and remove it from the list
A

[1, 3, 5]

In [23]:
# .insert() adds an element to a specific position
A.insert(3,20)
A

[1, 3, 5, 20]

In [24]:
# .sort() to sort the element in a list
A.sort()
A

[1, 3, 5, 20]

Copying Lists

In [25]:
A=list(range(1,6))
B=A
C=A.copy()
A[-1]=20 #changes the last element in A to 20
print(B) #channges
print(C) #remains the same

[1, 2, 3, 4, 20]
[1, 2, 3, 4, 5]

Exercise:  
    1. Create a list the first twenty postitive integers.  
    2. Create another list containing their squares.

In [26]:
#1
N=list(range(1,21))
SQUARES=[]
for number in N:
    square=number*number
    SQUARES.append(square)
SQUARES

[1,
 4,
 9,
 16,
 25,
 36,
 49,
 64,
 81,
 100,
 121,
 144,
 169,
 196,
 225,
 256,
 289,
 324,
 361,
 400]

Exercise:    
    1. Median is the middle value in sorted list of numbers.  
    2. Hint: use `.sort()` and indexing.

In [27]:
L=[1,4,6,7,43,8,3,9]
L.sort()
if len(L)%2==0:
    M=(L[int(len(L)/2)-1]+L[int((len(L)/2))])/2
    print(M)
else:
    M=L[int(len(L)/2)]
    print(float(M))

6.5

In [28]:
#checking the answer
import numpy as np
np.median(L)

6.5

## 1.2 Tuples
A tuple a type of sequences that resembles a list, except that, unlike a list, a tuple is immutable (can't be changed). A tuple literal in Python is enclosed in paranthesis.

In [29]:
werehouse=('Mumbai','Delhi','Kolkata','Chennai')
werehouse

('Mumbai', 'Delhi', 'Kolkata', 'Chennai')

In [30]:
for w in werehouse:
    print(w)

Mumbai
Delhi
Kolkata
Chennai

# 1.3 Dictionary
Dictionaries are Python's implementation of:
1. an associative array
2. a hash table
3. a lookup
A dictionary consists of a collection of key-value pairs (enters).  
A dictionary Python is comma seperated list of key-value pairs in curly braces{}. A colon (:) seperate each key from its associated value:  
d{key:value,.......,key:value}

In [31]:
tel={"Savansh":"476-3321","Nathaniel":"351-7743"}
tel

{'Savansh': '476-3321', 'Nathaniel': '351-7743'}

In [32]:
info={"name":"Molly","Age":23}
info

{'name': 'Molly', 'Age': 23}

### 1.3.1 Common Dictionary Operations

In [33]:
# Acessing a value by a key
info['name']

'Molly'

In [34]:
# Updating an existing key, value pair
info['name']='Sally'
info

{'name': 'Sally', 'Age': 23}

In [35]:
# Adding a new key, value pair
info['job']='Analyst'
info

{'name': 'Sally', 'Age': 23, 'job': 'Analyst'}

In [36]:
# Removing a key, pair
info.pop('name')
info

{'Age': 23, 'job': 'Analyst'}

In [37]:
# One can use del as well
del info['Age']

In [38]:
info

{'job': 'Analyst'}

In [39]:
#iterate through a dictionary
info={'name': 'Sally', 'Age': 23, 'job': 'Analyst'}
for key in info:
    print(key,':',info[key])

name : Sally
Age : 23
job : Analyst

### 1.3.2 Other Dictionary Operations
* `len(d)`: Returns the number of elements in d  
* `d.get(key[, default])` : Returns the value if the key exists or returns the default, If the key doesn't exist. Raises an error, if the default is omitted and the key does not exist.
* `list(d.keys())` : Returns; a list of the keys
* `list(d.values())` : Returns; a list of the values
* `d.clear` : Remove all entries from a dictionary

In [40]:
#length of the dict
len(info)

3

In [41]:
#list of keys in the dictionary
list(info.keys())

['name', 'Age', 'job']

In [42]:
#list of the valyes in the dictionary
list(info.values())

['Sally', 23, 'Analyst']

In [43]:
#Removing the contents of dict
info.clear()
info

{}

### 1.3.3 Dictionaries for representing data

In [44]:
#Dictionaries with values as lists
import pandas as pd
data={
    "Name":["BYJU's","Flipkart","Shutt"],
    "Industry":["e-tech","e-commerce","transport"],
    "funding":[200000000, 2500000000, 8648000000]
}
pd.DataFrame(data)

       Name    Industry     funding
0    BYJU's      e-tech   200000000
1  Flipkart  e-commerce  2500000000
2     Shutt   transport  8648000000

In [45]:
# List with dictionaries as elements
data=[{"Name":"BYJU's","Industry":"e-tech","funding":200000000},
      {"Name":"Flipkart","Industry":"e-commerce","funding":2500000000},
      {"Name":"Shutt","Industry":"transport","funding":8648000000}]

In [46]:
pd.DataFrame(data)

       Name    Industry     funding
0    BYJU's      e-tech   200000000
1  Flipkart  e-commerce  2500000000
2     Shutt   transport  8648000000

In [47]:
pd.DataFrame.from_records(data)

       Name    Industry     funding
0    BYJU's      e-tech   200000000
1  Flipkart  e-commerce  2500000000
2     Shutt   transport  8648000000

Exercise:  
1. Add a new row to the dataset
2. Add a new columns to the dataset

In [48]:
#Easy to add new row using list of dictionaries
data=[{"Name":"BYJU's","Industry":"e-tech","funding":200000000},
      {"Name":"Flipkart","Industry":"e-commerce","funding":2500000000},
      {"Name":"Shutt","Industry":"transport","funding":8648000000},
     {"Name":"PW","Industry":"ed-tech","funding":8008000000}]
pd.DataFrame(data)

       Name    Industry     funding
0    BYJU's      e-tech   200000000
1  Flipkart  e-commerce  2500000000
2     Shutt   transport  8648000000
3        PW     ed-tech  8008000000

In [49]:
#Easy to add new columns using dictionary of lists as values
data={
    "Name":["BYJU's","Flipkart","Shutt"],
    "Industry":["e-tech","e-commerce","transport"],
    "funding":[200000000, 2500000000, 8648000000],
    "Location":["Mumbai","Pune","Banglore"]}
pd.DataFrame(data)

       Name    Industry     funding  Location
0    BYJU's      e-tech   200000000    Mumbai
1  Flipkart  e-commerce  2500000000      Pune
2     Shutt   transport  8648000000  Banglore

Depending what kind of updation your job demands (adding rows / adding columns) we need to choose between dictionary of lists and list of dictionaries.

The End